Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/mental_health/mental_health_and_mental_illness.html.txt.tmx
Source language: en
Languages: ga

source: Overview of mental health and mental illness
ga: Meabhairshláinte agus breoiteacht mheabhrach

source: If you have a mental illness, your entitlement to care and treatment is the same as if you are suffering from other illness
ga: Má tá breoiteacht mheabhrach ort, is ionann an teidlíocht atá agat chun cúram agus cóireáil a fháil agus an teidlíocht a bheadh agat dá mbeifeá thíos le breoiteacht eile

source: You have the same entitlement to general health services and to community care services
ga: Tá an an teidlíocht chéanna agat do sheirbhísí ginearálta sláinte agus do sheirbhísí cúram pobail

source: The Mental Health Commission, has, among other things, overall responsibility for the standards of mental health services
ga: Tá ag an gCoimisiún Meabhair-Shláinte, i measc rudaí, eile, freagracht fhoriomlán as caighdeáin na seirbhísí meabhairshláinte

source: The Inspector of Mental Health Services carries out inspections of mental health facilities
ga: Tugann an Cigire Seirbhísí Meabhairshláinte faoi iniúchtaí ar áiseanna meabhairshláinte

source: The overall aim of mental health services policy is to provide care in the community as far as is possible
ga: Is é cuspóir foriomlán bheartais na Seirbhísí Meabhairshláínte chun cúram a sholáthar sa phobal, sa mhéid is féidir

source: There are specific mental health professionals who specialise in the provision of mental health services
ga: Tá gairmigh shonracha mheabhairshláinte ann a bhfuil saineolas acu i seirbhísí meabhairshláinte a sholáthar

source: In-patient services for people with mental illness are provided in approved psychiatric centres
ga: Soláthraítear seirbhísí othar cónaitheach do dhaoine ar a bhfuil breoiteacht mheabhrach in ionaid fhaofa shíciatracha

source: These are mainly psychiatric hospitals and psychiatric units in general hospitals
ga: Ospidéil shíciatracha agus aonaid shíciatracha in ospidéil ghinearálta iad seo, den chuid is mó

source: The rules about admission to approved centres are set out in the Mental Health Act 2001
ga: Leagtar amach na rialacha faoi aonaid fhaofa a iontráil san Acht Meabhair-Shláinte 2001

source: This Act also sets of the rights of psychiatric patients
ga: Leagtar amach san Acht seo, chomh maith, cearta othar síciatrach

source: The Mental Health Commission has published a booklet, Your Guide to the Mental Health Act 2001, that explains your rights under mental health law
ga: D'fhoilsigh an Coimisiún Meabhair-Shláinte leabhrán, Treoir don Achat Meabhair-Shláinte 2001, a mhiníonn do chearta faoin dlí meabhair-shláinte

source: The Health Service Executive (HSE) has an information booklet The Journey Together (pdf) for families and friends who support people experiencing mental health problems
ga: Tá leabhrán áisiúil faisnéise ag Feidhmeannacht na Seirbhíse Sláinte (FSS), An Turas Le Chéile (The Journey Together) (pdf) do theaghlaigh agus do chairde a thacaíonn le daoine ag a bhfuil fadhbanna meabhairshláinte
